InformationRegisters/сок_БуферЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>сок_БуферЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пометка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.сок_ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/сок_БуферДляЗакупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>сок_БуферДляЗакупки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пометка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НоменклатураЗаказа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.сок_НоменклатураЗаказа</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Требование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.сок_ТребованияОтделений</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/сок_ЗаявкаНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>сок_ЗаявкаНаРасходованиеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.сок_ГрафикПлатежей</xr:Item>
				<xr:Item>AccumulationRegister.сок_Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплатыФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНазначенияПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сок_КодыНазначенияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сок_СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сок_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сок_ВидЗаявкиАвансКредит</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВБитФинанс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификторПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПП</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Виза</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСогласования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.сок_СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.сок_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/сок_ФормаБуфераОплат/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Список.ОбновлениеПриИзмененииДанных=ОбновлениеПриИзмененииДанных.Авто;
КонецПроцедуры



&НаСервере
Процедура ИзменитьПолеРегистраНаСервере(КлючЗаписи,Имяполя,Значение)
	
		НачатьТранзакцию();
		
		Рег = РегистрыСведений.сок_БуферЗаявок.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Рег,КлючЗаписи);
		Рег.Прочитать();
		Рег[ИмяПоля]=Значение;
		Рег.Записать(Истина);
		ЗафиксироватьТранзакцию();
	
КонецПроцедуры	
&НаКлиенте
Процедура ИзменитьПолеОднимНажатием(КлючЗаписи,ИмяПоля,Значение)
	ИзменитьПолеРегистраНаСервере(КлючЗаписи,ИмяПоля,Значение);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСписокБезКонтекста(Форма)
	ТС = Форма.Элементы.Список.ТекущаяСтрока;
	Форма.Элементы.Список.Обновить();
	Форма.Элементы.Список.ТекущаяСтрока=ТС;
КонецПроцедуры	

&НаСервере
Процедура ОбновитьСписокНаСервере()
	ОбновитьСписокБезКонтекста(Этаформа);
КонецПроцедуры	



&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя="СписокПометка" Тогда
		ИзменитьПолеОднимНажатием(Элементы.Список.ТекущаяСтрока,"Пометка",НЕ Элементы.Список.ТекущиеДанные.Пометка);
		ОбновитьСписокНаСервере();
	//ИначеЕсли Поле.Имя="СписокДокументОснование" Тогда	
	ИначеЕсли Поле.Имя="СписокЗаказПоставщику" Тогда	
		Открытьформу("Документ.ЗаказПоставщику.ФормаОбъекта",Новый структура("Ключ",Элементы.Список.ТекущиеДанные.Заявка.ЗаказПоставщику),Этаформа);
	Иначе
		Открытьформу("Документ.сок_ЗаявкаНаРасходованиеДенежныхСредств.ФормаОбъекта",Новый структура("Ключ",Элементы.Список.ТекущиеДанные.Заявка),Этаформа);
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ=Истина;
КонецПроцедуры


&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;
КонецПроцедуры


&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	//Вернуть отказ
//	Отказ=Истина;
КонецПроцедуры

&НаСервере
Процедура ПометкаУстановитьНаСервере(Значение)
	
	Для Каждого Стр Из Элементы.Список.ВыделенныеСтроки Цикл
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	сок_БуферДляЗакупки.НоменклатураЗаказа КАК НоменклатураЗаказа,
		             |	сок_БуферДляЗакупки.Номенклатура КАК Номенклатура,
		             |	сок_БуферДляЗакупки.ДатаЗаказа КАК ДатаЗаказа,
		             |	сок_БуферДляЗакупки.Требование КАК Требование,
		             |	сок_БуферДляЗакупки.ИдентификаторСтроки КАК ИдентификаторСтроки,
		             |	сок_БуферДляЗакупки.КодСтроки КАК КодСтроки,
		             |	сок_БуферДляЗакупки.Количество КАК Количество,
		             |	сок_БуферДляЗакупки.Пометка КАК Пометка,
		             |	сок_БуферДляЗакупки.Менеджер КАК Менеджер,
		             |	сок_БуферДляЗакупки.Поставщик КАК Поставщик,
		             |	сок_БуферДляЗакупки.ЦенаЗакупки КАК ЦенаЗакупки
		             |ИЗ
		             |	РегистрСведений.сок_БуферДляЗакупки КАК сок_БуферДляЗакупки
		             |ГДЕ
		             |	сок_БуферДляЗакупки.ИдентификаторСтроки = &ИдентификаторСтроки
		             |	И сок_БуферДляЗакупки.КодСтроки = &КодСтроки";
		Запрос.УстановитьПараметр("ИдентификаторСтроки",Стр.ИдентификаторСтроки);
		Запрос.УстановитьПараметр("КодСтроки",Стр.КодСтроки);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			МенеджерЗаписи=РегистрыСведений.сок_БуферДляЗакупки.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Удалить();
			
			МенеджерЗаписи=РегистрыСведений.сок_БуферДляЗакупки.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
			МенеджерЗаписи.Пометка=Значение;
			Если Значение=Истина Тогда
				МенеджерЗаписи.Менеджер=ПараметрыСеанса.ТекущийПользователь;
			КонецЕсли;	
			МенеджерЗаписи.Записать(Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПометкаСнятьНаСервере()
	
	Для Каждого Стр Из Элементы.Список.ВыделенныеСтроки Цикл
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	сок_БуферДляЗакупки.НоменклатураЗаказа КАК НоменклатураЗаказа,
		             |	сок_БуферДляЗакупки.Номенклатура КАК Номенклатура,
		             |	сок_БуферДляЗакупки.ДатаЗаказа КАК ДатаЗаказа,
		             |	сок_БуферДляЗакупки.Требование КАК Требование,
		             |	сок_БуферДляЗакупки.ИдентификаторСтроки КАК ИдентификаторСтроки,
		             |	сок_БуферДляЗакупки.КодСтроки КАК КодСтроки,
		             |	сок_БуферДляЗакупки.Количество КАК Количество,
		             |	сок_БуферДляЗакупки.Пометка КАК Пометка,
		             |	сок_БуферДляЗакупки.Менеджер КАК Менеджер,
		             |	сок_БуферДляЗакупки.Поставщик КАК Поставщик,
		             |	сок_БуферДляЗакупки.ЦенаЗакупки КАК ЦенаЗакупки
		             |ИЗ
		             |	РегистрСведений.сок_БуферДляЗакупки КАК сок_БуферДляЗакупки
		             |ГДЕ
		             |	сок_БуферДляЗакупки.ИдентификаторСтроки = &ИдентификаторСтроки
		             |	И сок_БуферДляЗакупки.КодСтроки = &КодСтроки";
		Запрос.УстановитьПараметр("ИдентификаторСтроки",Стр.ИдентификаторСтроки);
		Запрос.УстановитьПараметр("КодСтроки",Стр.КодСтроки);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			МенеджерЗаписи=РегистрыСведений.сок_БуферДляЗакупки.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Удалить();
			
			МенеджерЗаписи=РегистрыСведений.сок_БуферДляЗакупки.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
			МенеджерЗаписи.Пометка=Ложь;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометкаСнять(Команда)
	
	ПометкаУстановитьНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометкаУстановить(Команда)
	
	ПометкаУстановитьНаСервере(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ВБитФинансНаСервере()
	НачатьТранзакцию();        
	Запрос = новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	сок_БуферЗаявок.Заявка КАК Заявка
	|ИЗ
	|	РегистрСведений.сок_БуферЗаявок КАК сок_БуферЗаявок
	|ГДЕ
	|	сок_БуферЗаявок.Пометка";
	Выборка = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр из Выборка Цикл
		
		
		
		
		Элемент = Стр.заявка.ПолучитьОбъект();
		
		Если Ложь Тогда Элемент = Документы.сок_ЗаявкаНаРасходованиеДенежныхСредств.СоздатьДокумент() КонецЕсли;
		Если Элемент.ДоговорКонтрагента.ПодключенБитФинанс Тогда
			Если Сок_Веб.ОтправитьЗаявкуНаРасходованиеДенежныхСредств(Элемент) Тогда
				
				Элемент.Отправлена=Истина;
				Элемент.ДатаОтправки=ТекущаяДата();
				Попытка
					Элемент.Записать(РежимЗаписиДокумента.Проведение);
				Исключение   
					ТекстСообщения="Не удлось изменить "+Стр.Заявка;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					ОтменитьТранзакцию();
					Возврат;
				Конецпопытки;
				
				РегБ = РегистрыСведений.сок_БуферЗаявок.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(РегБ,Стр);
				РегБ.Прочитать();
				Если РегБ.Выбран() Тогда
					РегБ.Удалить();
				КонецЕсли;	
			КонецЕсли;;
		Иначе     
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю("Договор не подключен к бит-финанс. Отправка заявки не возможна "+Стр.Заявка);
		КонецЕсли;	
	КонецЦикла;	
	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура ВБитФинанс(Команда)
	ВБитФинансНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры
